# 1. Básico sobre o Data

In [1]:
pwd #obtem o local de trabalho atual do python

'C:\\Users\\Admin\\Documents\\Python\\python_pandas_livro\\src'

In [1]:
import pandas as pd #importa a biblioteca Pandas e dá a ela um nome mais simples para ser usada no código 'pd'

In [2]:
df = pd.read_csv('..\\data\\gapminder.tsv', sep='\t') #lê o arquivo 'tsv' (separado por tab) que está num diretório acima, na pasta 'data' e salva os dados na variável 'df'

In [3]:
df.columns #mostra as colunas do dataset

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [4]:
df.dtypes #mostra os tipos das colunas string, string, inteiro, float, inteiro, float respectivamente

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [5]:
df.info() #mostra quantas linhas de dados cada coluna possui, bem como, se existem valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 66.6+ KB

In [6]:
df.head() #mostra as 5 primeiras linhas do dataset

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [7]:
paises = df['country'] #exibe apenas a coluna 'country' e salva os dados colhidos na variável 'paises'

In [8]:
paises.head() #exibe apenas os primeiros 5 resultados da variável 'paises' que recebeu os dados da linha acima.

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [9]:
print(paises.tail()) #exibe os últimos 5 resultados da variável 'países', desssa vez utilizando o método 'print'

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [10]:
subset = df[['country', 'continent', 'year']] #a variável subset recebe os valores apenas das colunas 'country', 'continent', 'year' do dataset.

In [11]:
subset.head() #como explicado anteriormente, apenas o 5 primeiros resultados.

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [13]:
subset.tail() #como explicado anteriormente, apenas os 5 últimos resultados.

       country continent  year
1699  Zimbabwe    Africa  1987
1700  Zimbabwe    Africa  1992
1701  Zimbabwe    Africa  1997
1702  Zimbabwe    Africa  2002
1703  Zimbabwe    Africa  2007

In [14]:
df.head() #obtendo novamente os 5 primeiros resultados do dataset

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [15]:
df.loc[0] #método 'loc' devolve uma linha a partir da informação de seu rótulo, neste caso foi devolvido a linha com rótulo '0', ou seja, a primeira linha.

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [17]:
df.loc[99] #obtém a centésima linha, python começa a contar a partir de 0;

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap       721.186
Name: 99, dtype: object

In [23]:
df.shape #o atributo 'shape' devolve a quantidade de linhas e colunas do dataset

(1704, 6)

In [24]:
df.shape[0] #devolve apenas o número de linhas totais

1704

In [19]:
numLinhas = df.shape[0] #variável 'numLinhas' recebe o quantidade de linhas totais

In [21]:
ultimaLinha = numLinhas - 1 #número de linhas totais -1 pq o python começa a contar a partir do O;

In [22]:
df.loc[ultimaLinha] #mostra a última linha do dataset.

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [27]:
df.tail(1) #exibindo a última linha (1) do dataset como o método 'tail'

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [28]:
subset_loc = df.loc[0]
subset_tail = df.tail(1)

In [29]:
type(subset_loc) #o valor devolvido por loc é sempre uma Série

pandas.core.series.Series

In [30]:
type(subset_tail) #o valor devolvido por tail ou head é sempre  um dataframe, ou seja, um valor de uma planilha

pandas.core.frame.DataFrame

In [32]:
df.loc[[0, 99, 999]] #Obtenção de um conjunto com várias linhas, neste caso: a primeira, a centésima e a milésima linha
#observe os colchetes duplos

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [33]:
df.iloc[1] #obtem a segunda linha do dataset, através do número da linha e não mais pelo seu rótulo, nem sempre o número da linha
#será igual ao rótulo da linha.

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap        820.853
Name: 1, dtype: object

In [34]:
df.iloc[99] #obtém a centésima linha

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap       721.186
Name: 99, dtype: object

In [37]:
df.iloc[-1] #utilizando -1 para obter a última linha;

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [38]:
df.iloc[[0, 99, 999]] #como utilizado anteriormente, podemos também obter um subconjunto de linhas, passando os números da linhas
#através de colchetes duplos.

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [3]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [9]:
smallRange = list(range(10))

In [10]:
print(smallRange)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [17]:
df.iloc[smallRange, [0, 1, -1]] #mostra as primeiras 10 linhas, juntamente com a primeira, segunda e última coluna.

       country continent   gdpPercap
0  Afghanistan      Asia  779.445314
1  Afghanistan      Asia  820.853030
2  Afghanistan      Asia  853.100710
3  Afghanistan      Asia  836.197138
4  Afghanistan      Asia  739.981106
5  Afghanistan      Asia  786.113360
6  Afghanistan      Asia  978.011439
7  Afghanistan      Asia  852.395945
8  Afghanistan      Asia  649.341395
9  Afghanistan      Asia  635.341351

In [18]:
df.loc[:, ['country', 'continent', 'pop']] #exibe todas as linhas, juntamente com as colunas 'country', 'continent', 'pop'

          country continent       pop
0     Afghanistan      Asia   8425333
1     Afghanistan      Asia   9240934
2     Afghanistan      Asia  10267083
3     Afghanistan      Asia  11537966
4     Afghanistan      Asia  13079460
5     Afghanistan      Asia  14880372
6     Afghanistan      Asia  12881816
7     Afghanistan      Asia  13867957
8     Afghanistan      Asia  16317921
9     Afghanistan      Asia  22227415
10    Afghanistan      Asia  25268405
11    Afghanistan      Asia  31889923
12        Albania    Europe   1282697
13        Albania    Europe   1476505
14        Albania    Europe   1728137
15        Albania    Europe   1984060
16        Albania    Europe   2263554
17        Albania    Europe   2509048
18        Albania    Europe   2780097
19        Albania    Europe   3075321
20        Albania    Europe   3326498
21        Albania    Europe   3428038
22        Albania    Europe   3508512
23        Albania    Europe   3600523
24        Algeria    Africa   9279525
25        Algeria    Africa  10270856
26        Algeria    Africa  11000948
27        Algeria    Africa  12760499
28        Algeria    Africa  14760787
29        Algeria    Africa  17152804
...           ...       ...       ...
1674  Yemen, Rep.      Asia   9657618
1675  Yemen, Rep.      Asia  11219340
1676  Yemen, Rep.      Asia  13367997
1677  Yemen, Rep.      Asia  15826497
1678  Yemen, Rep.      Asia  18701257
1679  Yemen, Rep.      Asia  22211743
1680       Zambia    Africa   2672000
1681       Zambia    Africa   3016000
1682       Zambia    Africa   3421000
1683       Zambia    Africa   3900000
1684       Zambia    Africa   4506497
1685       Zambia    Africa   5216550
1686       Zambia    Africa   6100407
1687       Zambia    Africa   7272406
1688       Zambia    Africa   8381163
1689       Zambia    Africa   9417789
1690       Zambia    Africa  10595811
1691       Zambia    Africa  11746035
1692     Zimbabwe    Africa   3080907
1693     Zimbabwe    Africa   3646340
1694     Zimbabwe    Africa   4277736
1695     Zimbabwe    Africa   4995432
1696     Zimbabwe    Africa   5861135
1697     Zimbabwe    Africa   6642107
1698     Zimbabwe    Africa   7636524
1699     Zimbabwe    Africa   9216418
1700     Zimbabwe    Africa  10704340
1701     Zimbabwe    Africa  11404948
1702     Zimbabwe    Africa  11926563
1703     Zimbabwe    Africa  12311143

[1704 rows x 3 columns]

In [22]:
colunas = list(range(6))

In [23]:
colunas

[0, 1, 2, 3, 4, 5]

In [25]:
df.iloc[:, colunas] #obtendo subconjunto de colunas através de um intervalo dado de lista.

          country continent  year  lifeExp       pop    gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333   779.445314
1     Afghanistan      Asia  1957   30.332   9240934   820.853030
2     Afghanistan      Asia  1962   31.997  10267083   853.100710
3     Afghanistan      Asia  1967   34.020  11537966   836.197138
4     Afghanistan      Asia  1972   36.088  13079460   739.981106
5     Afghanistan      Asia  1977   38.438  14880372   786.113360
6     Afghanistan      Asia  1982   39.854  12881816   978.011439
7     Afghanistan      Asia  1987   40.822  13867957   852.395945
8     Afghanistan      Asia  1992   41.674  16317921   649.341395
9     Afghanistan      Asia  1997   41.763  22227415   635.341351
10    Afghanistan      Asia  2002   42.129  25268405   726.734055
11    Afghanistan      Asia  2007   43.828  31889923   974.580338
12        Albania    Europe  1952   55.230   1282697  1601.056136
13        Albania    Europe  1957   59.280   1476505  1942.284244
14        Albania    Europe  1962   64.820   1728137  2312.888958
15        Albania    Europe  1967   66.220   1984060  2760.196931
16        Albania    Europe  1972   67.690   2263554  3313.422188
17        Albania    Europe  1977   68.930   2509048  3533.003910
18        Albania    Europe  1982   70.420   2780097  3630.880722
19        Albania    Europe  1987   72.000   3075321  3738.932735
20        Albania    Europe  1992   71.581   3326498  2497.437901
21        Albania    Europe  1997   72.950   3428038  3193.054604
22        Albania    Europe  2002   75.651   3508512  4604.211737
23        Albania    Europe  2007   76.423   3600523  5937.029526
24        Algeria    Africa  1952   43.077   9279525  2449.008185
25        Algeria    Africa  1957   45.685  10270856  3013.976023
26        Algeria    Africa  1962   48.303  11000948  2550.816880
27        Algeria    Africa  1967   51.407  12760499  3246.991771
28        Algeria    Africa  1972   54.518  14760787  4182.663766
29        Algeria    Africa  1977   58.014  17152804  4910.416756
...           ...       ...   ...      ...       ...          ...
1674  Yemen, Rep.      Asia  1982   49.113   9657618  1977.557010
1675  Yemen, Rep.      Asia  1987   52.922  11219340  1971.741538
1676  Yemen, Rep.      Asia  1992   55.599  13367997  1879.496673
1677  Yemen, Rep.      Asia  1997   58.020  15826497  2117.484526
1678  Yemen, Rep.      Asia  2002   60.308  18701257  2234.820827
1679  Yemen, Rep.      Asia  2007   62.698  22211743  2280.769906
1680       Zambia    Africa  1952   42.038   2672000  1147.388831
1681       Zambia    Africa  1957   44.077   3016000  1311.956766
1682       Zambia    Africa  1962   46.023   3421000  1452.725766
1683       Zambia    Africa  1967   47.768   3900000  1777.077318
1684       Zambia    Africa  1972   50.107   4506497  1773.498265
1685       Zambia    Africa  1977   51.386   5216550  1588.688299
1686       Zambia    Africa  1982   51.821   6100407  1408.678565
1687       Zambia    Africa  1987   50.821   7272406  1213.315116
1688       Zambia    Africa  1992   46.100   8381163  1210.884633
1689       Zambia    Africa  1997   40.238   9417789  1071.353818
1690       Zambia    Africa  2002   39.193  10595811  1071.613938
1691       Zambia    Africa  2007   42.384  11746035  1271.211593
1692     Zimbabwe    Africa  1952   48.451   3080907   406.884115
1693     Zimbabwe    Africa  1957   50.469   3646340   518.764268
1694     Zimbabwe    Africa  1962   52.358   4277736   527.272182
1695     Zimbabwe    Africa  1967   53.995   4995432   569.795071
1696     Zimbabwe    Africa  1972   55.635   5861135   799.362176
1697     Zimbabwe    Africa  1977   57.674   6642107   685.587682
1698     Zimbabwe    Africa  1982   60.363   7636524   788.855041
1699     Zimbabwe    Africa  1987   62.351   9216418   706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340   693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948   792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563   672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143   469.709298

[1704 rows x 6 columns]

In [26]:
pulaLinha = list(range(0, 10, 2))

In [27]:
pulaLinha

[0, 2, 4, 6, 8]

In [28]:
df.iloc[pulaLinha, :] #exibindo as linhas pares até 10 e todas as colunas.

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
8  Afghanistan      Asia  1992   41.674  16317921  649.341395

In [33]:
colunas = list(range(0, 6, 2))

In [32]:
df.iloc[pulaLinha, [2, 4, -1]]

   year       pop   gdpPercap
0  1952   8425333  779.445314
2  1962  10267083  853.100710
4  1972  13079460  739.981106
6  1982  12881816  978.011439
8  1992  16317921  649.341395

In [34]:
df.iloc[:, colunas]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
5     Afghanistan  1977  14880372
6     Afghanistan  1982  12881816
7     Afghanistan  1987  13867957
8     Afghanistan  1992  16317921
9     Afghanistan  1997  22227415
10    Afghanistan  2002  25268405
11    Afghanistan  2007  31889923
12        Albania  1952   1282697
13        Albania  1957   1476505
14        Albania  1962   1728137
15        Albania  1967   1984060
16        Albania  1972   2263554
17        Albania  1977   2509048
18        Albania  1982   2780097
19        Albania  1987   3075321
20        Albania  1992   3326498
21        Albania  1997   3428038
22        Albania  2002   3508512
23        Albania  2007   3600523
24        Algeria  1952   9279525
25        Algeria  1957  10270856
26        Algeria  1962  11000948
27        Algeria  1967  12760499
28        Algeria  1972  14760787
29        Algeria  1977  17152804
...           ...   ...       ...
1674  Yemen, Rep.  1982   9657618
1675  Yemen, Rep.  1987  11219340
1676  Yemen, Rep.  1992  13367997
1677  Yemen, Rep.  1997  15826497
1678  Yemen, Rep.  2002  18701257
1679  Yemen, Rep.  2007  22211743
1680       Zambia  1952   2672000
1681       Zambia  1957   3016000
1682       Zambia  1962   3421000
1683       Zambia  1967   3900000
1684       Zambia  1972   4506497
1685       Zambia  1977   5216550
1686       Zambia  1982   6100407
1687       Zambia  1987   7272406
1688       Zambia  1992   8381163
1689       Zambia  1997   9417789
1690       Zambia  2002  10595811
1691       Zambia  2007  11746035
1692     Zimbabwe  1952   3080907
1693     Zimbabwe  1957   3646340
1694     Zimbabwe  1962   4277736
1695     Zimbabwe  1967   4995432
1696     Zimbabwe  1972   5861135
1697     Zimbabwe  1977   6642107
1698     Zimbabwe  1982   7636524
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [35]:
small_range = list(range(3))

In [38]:
subset = df.iloc[:, :3] #fatia as 3 primeiras colunas

In [39]:
print(subset.head())

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [40]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [41]:
small_range = list(range(3, 6))

In [42]:
subset = df.iloc[:, small_range]

In [43]:
print(subset.head())

   lifeExp       pop   gdpPercap
0   28.801   8425333  779.445314
1   30.332   9240934  820.853030
2   31.997  10267083  853.100710
3   34.020  11537966  836.197138
4   36.088  13079460  739.981106

In [44]:
subset = df.iloc[:, 3:6] #usando fatiamento (slice) para exibir subconjunto de colunas

In [45]:
print(subset.head())

   lifeExp       pop   gdpPercap
0   28.801   8425333  779.445314
1   30.332   9240934  820.853030
2   31.997  10267083  853.100710
3   34.020  11537966  836.197138
4   36.088  13079460  739.981106

In [46]:
subset = df.iloc[:, 0:6:2]

In [47]:
print(subset.head())

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [48]:
subset = df.iloc[:, 0:6:] #exibe todas as linhas e coluna, equivalente a 0:6

In [49]:
print(subset.head())

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [50]:
subset = df.iloc[:, 0::2] #exibe todas as linhas e as 3 primeiras colunas.

In [51]:
print(subset.head())

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [53]:
df.iloc[:, :6:2].head() #de 0 a 5, pulando pulando de 2 em 2.

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [54]:
df.iloc[:, ::2].head() #exibe as 3 primeiras colunas, equivalente a 0:2

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [55]:
df.iloc[:, ::].head() #exibe todas as linhas e colunas, equivalente a [:]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

# 1.3.3.4 Obtendo subconjunto de linhas e coluna; pag 49